Revit 2026 API

# ElectricalSystemNeutralConductorSize Property

---

The size of a Neutral Conductor in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId NeutralConductorSize { get; }
```
```vb
Public ReadOnly Property NeutralConductorSize As ElementId
	Get
```
```cpp
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
}
```
```fsharp
member NeutralConductorSize : ElementId with get
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Each Neutral Conductor has the same size in the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace